package CCProgrammingContest.V2022Question4;

/**
 * 问题 D: 项目周期估算
 *
 * 题目描述
 * 你担任了某个自研项目的项目经理。前期经过需求分析给出了 n 个任务，每个任务都需要经历设计、开发、测试三个阶段。每个阶段都需要一定的时间完成，必须按照设计、开发、测试的顺序进行，并且三个阶段在时间上不能重叠。
 * 每个任务都设置了一个优先级，这个值越小意味着优先级越高。
 * 项目组一共有 x 个设计人员，y 个开发人员，z 个测试人员。每个人同时只能做一个任务，一个任务同一时刻也只需要一个人参与。并且设计人员只能设计，开发人员只能开发，测试人员只能测试。
 * 每个人员一旦遇到可以进行的任务，并且自己处于空闲状态，就会立即开始做这个任务。如果此时有多个任务可以开始，则优先做优先级高的任务。当所有的任务都测试完成后，就认为整个项目完成了。
 * 现在已经估算出每个任务的优先级和每个阶段需要的时间，请计算整个项目从开始到完成共需要多少天。
 *
 * 输入
 * 第一行是由空格分隔的四个整数 n，x，y，z，分别表示有 n 项任务，x 名设计人员，y 名开发人员，z 名测试人员。
 * 接下来一共 n 行，每一行都是由空格分隔的四个整数，分别表示一个任务的优先级，设计、开发和测试阶段各需要几天时间。
 * 数据范围 1<=n<=1000，1<=x, y, z<=10，每个任务的各个阶段都不超过100天。
 * 输入保证每个任务的优先级不重复，并且任务按照优先级从高到低的顺序排列。
 *
 * 输出
 * 整个项目一共需要多少天完成。
 *
 * 样例输入 Copy
 * 3 2 2 2
 * 1 1 2 1
 * 2 1 2 1
 * 3 1 2 1
 * 样例输出 Copy
 * 6
 *
 * 提示
 * 样例说明
 * 一共有 3 个任务，设计、开发、测试人员各两名。
 * 2 名设计人员会优先做优先级为 1 和 2 的两个任务，需要 1 天时间，接下来其中 1 名设计人员做优先级为 3 的任务。
 * 2 名开发人员从第 2 天开始做前两个任务，各需要两天时间。接下来 1 名开发人员开始做第 3 个任务。
 * 2 名测试人员从第 4 天开始做前两个任务。然后第 3 个任务要到第 6 天才会进入测试阶段，需要 1 天测试完成。
 * 整个项目总共需要 6 天时间。
 *
 * 样例输入2
 * 4 1 2 2
 * 1 1 2 5
 * 2 1 1 3
 * 3 1 3 3
 * 4 1 1 2
 *
 * 样例输出2
 * 10
 */
public class Main {
}
